from django import forms
from .models import ColdWaterTable, HotWaterTable, WarmTable, ElectricityTable, TemperatureTable
import datetime

CHOICES_month = (
		(1, "січень"), (2, "лютий"), (3, "березень"), (4, "квітень"), (5, "травень"), (6, "червень"), (7, "липень"),
		(8, "серпень"), (9, "вересень"), (10, "жовтень"), (11, "листопад"), (12, "грудень"),
	)
def CHOICES_year():
		return [(r,r) for r in range(2015,datetime.date.today().year + 1)]

class AddColdWaterTableDataForm(forms.Form):

	CHOICES_building=(
		(1,"Навчальний корпус №1"),(2,"Навчальний корпус №2"),(3,"Навчальний корпус №4"),
		(4,"Навчальний корпус №5"),(5,"Навчальний корпус №6"),(6,"Навчальний корпус №7"),
		(7,"Гараж військової кафедри"),(8,"Спортивний корпус"),(9,"Їдальня №1"),
		(10,"Гуртожиток №1"),(11,"Гуртожиток №2"),(12,"Гуртожиток №3"),
		(13,"Гуртожиток №4"),(14,"Гуртожиток №5"),(15,"Гуртожиток №6"),
		(16,"Гуртожиток №7"),(17,"Гуртожиток №8"),(18,"Павільйон бурових машин"),
		(19,"Автогосподарство"),(20,"Майстерня-котельня"),(21,"Інститут післядипломної освіти")
	)
	date_month = forms.ChoiceField(label="Місяць",choices=CHOICES_month, widget=forms.Select)
	date_year = forms.ChoiceField(label="Рік",choices=CHOICES_year, widget=forms.Select)
	building = forms.ChoiceField(label="Будівля",choices=CHOICES_building, widget=forms.Select)
	value = forms.FloatField(label="Введіть спожиту кількість холодної води за вказаний період")
 	
class AddHotWaterTableDataForm(forms.Form):

	CHOICES_building=(
		(1,"Гуртожиток №7 504"),(2,"Гуртожиток №7 3246"),(3,"Гуртожиток №8 2464"),
		(4,"Гуртожиток №8 2481")
	)
	date_month = forms.ChoiceField(label="Місяць",choices=CHOICES_month, widget=forms.Select)
	date_year = forms.ChoiceField(label="Рік",choices=CHOICES_year, widget=forms.Select)
	building = forms.ChoiceField(label="Будівля",choices=CHOICES_building, widget=forms.Select)
	value = forms.FloatField(label="Введіть спожиту кількість гарячої води за вказаний період")

class AddWarmTableDataForm(forms.Form):

	CHOICES_building=(
		(1,"Навчальний корпус №1 3317"),(2,"Гуртожиток №7 3873"),(3,"Гуртожиток №8 3867"),
		(4,"Котельня 016189"), (5,"Інститут післядипломної освіти 016504183")
	)
	date_month = forms.ChoiceField(label="Місяць",choices=CHOICES_month, widget=forms.Select)
	date_year = forms.ChoiceField(label="Рік",choices=CHOICES_year, widget=forms.Select)
	building = forms.ChoiceField(label="Будівля",choices=CHOICES_building, widget=forms.Select)
	value = forms.FloatField(label="Введіть спожиту кількість енергоресурсу за вказаний період")

class AddTemperatureTableDataForm(forms.Form):

	CHOICES_building=(
		(1,"Навчальний корпус №1"),(2,"Навчальний корпус №2"),(3,"Навчальний корпус №4"),
		(4,"Навчальний корпус №5"),(5,"Навчальний корпус №6"),(6,"Навчальний корпус №7"),
		(7,"Гараж військової кафедри"),(8,"Спортивний корпус"),(9,"Їдальня №1"),
		(10,"Гуртожиток №1"),(11,"Гуртожиток №2"),(12,"Гуртожиток №3"),
		(13,"Гуртожиток №4"),(14,"Гуртожиток №5"),(15,"Гуртожиток №6"),
		(16,"Гуртожиток №7"),(17,"Гуртожиток №8"),(18,"Павільйон бурових машин"),
		(19,"Автогосподарство"),(20,"Майстерня-котельня"),(21,"Інститут післядипломної освіти")
	)
	date_month = forms.ChoiceField(label="Місяць",choices=CHOICES_month, widget=forms.Select)
	date_year = forms.ChoiceField(label="Рік",choices=CHOICES_year, widget=forms.Select)
	building = forms.ChoiceField(label="Будівля",choices=CHOICES_building, widget=forms.Select)
	value = forms.FloatField(label="Введіть температуру")

class AddElectricityTableDataForm(forms.Form):

	CHOICES_building=(
		(1,"Навчальний корпус №1 (активна)  0147660"),(2,"Навчальний корпус №1 (реактивна)  0147660"),(3,"Навчальний корпус №1 (генерація)  0147660"),
		(4,"Навчальний корпус №2 (активна) 255447"),(5,"Навчальний корпус №2 (реактивна) 255447"),(6,"Навчальний корпус №2 (генерація) 255447"),
		(7,"Навчальний корпус №2 (активна) 255388 "),(8,"Навчальний корпус №2 (реактивна) 255388"),(9,"Навчальний корпус №2 (генерація) 255388"),
		(10,"Навчальний корпус №2а (активна) 0223942"),(11,"Навчальний корпус №2а (реактивна) 0223942"),(12,"Навчальний корпус №2а (генерація)0223942"), 
		(13,"Навчальний корпус №2а (активна) 0147641"),(14,"Навчальний корпус №2а (реактивна) 0147641"),(15,"Навчальний корпус №2а (генерація) 0147641"),
		(16,"Навчальний корпус №6 (активна) 0147881"),(17,"Навчальний корпус №6 (реактивна) 0147881"),(18,"Навчальний корпус №6 (активна) 0147901"),
		(19,"Навчальний корпус №6 (реактивна) 0147901"),(20,"Навчальний корпус №7 (активна) 0147668"),(21,"Навчальний корпус №7 (реактивна) 0147668"),
		(22,"Комора (активна) 7924948"),(23,"Їдальня №1 (активна) 0204848"),(24,"Гараж (активна) 8049260"),
		(25,"Гараж (реактивна) 8049260"),(26,"Гараж (генерація) 8049260"),(27,"Полігон (генерація) 7945301"),
		(28,"Буровий павільйон (активна) 20292980"),(29,"Гуртожиток №1 (активна) 53035"),(30,"Гуртожиток №2 (активна) 111616"),
		(31,"Гуртожиток №3 (активна) 244403"),(32,"Гуртожиток №4 (активна) 111580"),(33,"Гуртожиток №5 (активна) 100401"),
		(34,"Гуртожиток №6 (активна) 111617"),(35,"Гуртожиток №6 (активна) 38469"),(36,"Гуртожиток №7 (активна) 38399"),
		(37,"Гуртожиток №7 (активна) 100387"),(38,"Гуртожиток №8 (активна) 38152"),(39,"Гуртожиток №8 (активна) 111578"),
		(40,"Гуртожиток №8 (активна) 01022579"),(41,"ТП-38 (активна) 255387"),(42,"ТП-38 (реактивна) 255387"),
		(43,"ТП-38 (генерація) 255387"),(44,"ТП-72 (активна) 255385"),(45,"ТП-72 (реактивна) 255385"),
		(46,"ТП-72 (генерація) 255385"),(47,"Інститут післядипломної освіти (активна) 0979485")
	)
	date_month = forms.ChoiceField(label="Місяць",choices=CHOICES_month, widget=forms.Select)
	date_year = forms.ChoiceField(label="Рік",choices=CHOICES_year, widget=forms.Select)
	building = forms.ChoiceField(label="Будівля",choices=CHOICES_building, widget=forms.Select)
	value = forms.FloatField(label="Введіть спожиту кількість електроенергії за вказаний період")

